src/test/resources/templates/stripe/create_payment_intent_requires_3ds_response.json

{
  "id": "pi_123",
  "object": "payment_intent",
  "amount": 1000,
  "amount_capturable": 0,
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "manual",
  "charges": {
    "object": "list",
    "data": [
    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges?payment_intent=pi_123"
  },
  "client_secret": "secret",
  "confirmation_method": "automatic",
  "created": 1568141588,
  "currency": "gbp",
  "customer": null,
  "description": null,
  "invoice": null,
  "last_payment_error": null,
  "livemode": false,
  "metadata": {
  },
  "next_action": {
    "redirect_to_url": {
      "return_url": "http://localhost:9000/card_details/charge_id/3ds_required_in",
      "url": "https://hooks.stripe.com/3d_secure_2/hosted?payment_intent=payment_intent_id&payment_intent_client_secret=fssfbbd"
    },
    "type": "redirect_to_url"
  },
  "on_behalf_of": "acct_123",
  "payment_method": {
    "id": "pm_123",
    "card": {
      "exp_month": 8,
      "exp_year": 2024
    }
  },
  "payment_method_options": {
    "card": {
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card"
  ],
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "requires_action",
  "transfer_data": null,
  "transfer_group": "tgroup"
}
